feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH47.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH47.
*/
#define	SRC_DMACH47	(SRC_DMA_DMA0_CH47)

/** \brief  5C0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH48 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385C0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH48.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH48.
*/
#define	SRC_DMACH48	(SRC_DMA_DMA0_CH48)

/** \brief  5C4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH49 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385C4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH49.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH49.
*/
#define	SRC_DMACH49	(SRC_DMA_DMA0_CH49)

/** \brief  514, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038514u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH5.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH5.
*/
#define	SRC_DMACH5	(SRC_DMA_DMA0_CH5)

/** \brief  5C8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH50 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385C8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH50.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH50.
*/
#define	SRC_DMACH50	(SRC_DMA_DMA0_CH50)

/** \brief  5CC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH51 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385CCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH51.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH51.
*/
#define	SRC_DMACH51	(SRC_DMA_DMA0_CH51)

/** \brief  5D0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH52 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385D0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH52.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH52.
*/
#define	SRC_DMACH52	(SRC_DMA_DMA0_CH52)

/** \brief  5D4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH53 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385D4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH53.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH53.
*/
#define	SRC_DMACH53	(SRC_DMA_DMA0_CH53)

/** \brief  5D8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH54 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385D8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH54.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH54.
*/
#define	SRC_DMACH54	(SRC_DMA_DMA0_CH54)

/** \brief  5DC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH55 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385DCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH55.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH55.
*/
#define	SRC_DMACH55	(SRC_DMA_DMA0_CH55)

/** \brief  5E0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH56 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH56.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH56.
*/
#define	SRC_DMACH56	(SRC_DMA_DMA0_CH56)

/** \brief  5E4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH57 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH57.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH57.
*/
#define	SRC_DMACH57	(SRC_DMA_DMA0_CH57)

/** \brief  5E8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH58 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH58.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH58.
*/
#define	SRC_DMACH58	(SRC_DMA_DMA0_CH58)

/** \brief  5EC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH59 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385ECu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH59.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH59.
*/
#define	SRC_DMACH59	(SRC_DMA_DMA0_CH59)

/** \brief  518, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038518u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH6.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH6.
*/
#define	SRC_DMACH6	(SRC_DMA_DMA0_CH6)

/** \brief  5F0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH60 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH60.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH60.
*/
#define	SRC_DMACH60	(SRC_DMA_DMA0_CH60)

/** \brief  5F4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH61 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH61.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH61.
*/
#define	SRC_DMACH61	(SRC_DMA_DMA0_CH61)

/** \brief  5F8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH62 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH62.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH62.
*/
#define	SRC_DMACH62	(SRC_DMA_DMA0_CH62)

/** \brief  5FC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH63 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385FCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH63.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH63.
*/
#define	SRC_DMACH63	(SRC_DMA_DMA0_CH63)

/** \brief  51C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003851Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH7.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH7.
*/
#define	SRC_DMACH7	(SRC_DMA_DMA0_CH7)

/** \brief  520, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038520u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH8.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH8.
*/
#define	SRC_DMACH8	(SRC_DMA_DMA0_CH8)

/** \brief  524, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038524u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH9.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH9.
*/
#define	SRC_DMACH9	(SRC_DMA_DMA0_CH9)

