feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSrc_reg.h
/** \brief  4F0, DMA Error Service Request */
#define SRC_DMA_DMA0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_ERR.
* To use register names with standard convension, please use SRC_DMA_DMA0_ERR.
*/
#define	SRC_DMAERR	(SRC_DMA_DMA0_ERR)

/** \brief  B54, DSADC SRA Service Request */
#define SRC_DSADC_DSADC0_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B54u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRA.
*/
#define	SRC_DSADCSRA0	(SRC_DSADC_DSADC0_SRA)

/** \brief  B50, DSADC SRM Service Request */
#define SRC_DSADC_DSADC0_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B50u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRM.
*/
#define	SRC_DSADCSRM0	(SRC_DSADC_DSADC0_SRM)

/** \brief  B5C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC1_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B5Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRA.
*/
#define	SRC_DSADCSRA1	(SRC_DSADC_DSADC1_SRA)

/** \brief  B58, DSADC SRM Service Request */
#define SRC_DSADC_DSADC1_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B58u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRM.
*/
#define	SRC_DSADCSRM1	(SRC_DSADC_DSADC1_SRM)

/** \brief  B64, DSADC SRA Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B64u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define	SRC_DSADCSRA2	(SRC_DSADC_DSADC2_SRA)

/** \brief  B60, DSADC SRM Service Request */
#define SRC_DSADC_DSADC2_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B60u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRM.
*/
#define	SRC_DSADCSRM2	(SRC_DSADC_DSADC2_SRM)

/** \brief  B6C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC3_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B6Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRA.
*/
#define	SRC_DSADCSRA3	(SRC_DSADC_DSADC3_SRA)

/** \brief  B68, DSADC SRM Service Request */
#define SRC_DSADC_DSADC3_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B68u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRM.
*/
#define	SRC_DSADCSRM3	(SRC_DSADC_DSADC3_SRM)

/** \brief  B74, DSADC SRA Service Request */
#define SRC_DSADC_DSADC4_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B74u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRA.
*/
#define	SRC_DSADCSRA4	(SRC_DSADC_DSADC4_SRA)

/** \brief  B70, DSADC SRM Service Request */
#define SRC_DSADC_DSADC4_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B70u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRM.
*/
#define	SRC_DSADCSRM4	(SRC_DSADC_DSADC4_SRM)

/** \brief  B7C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC5_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B7Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRA.
*/
#define	SRC_DSADCSRA5	(SRC_DSADC_DSADC5_SRA)

/** \brief  B78, DSADC SRM Service Request */
#define SRC_DSADC_DSADC5_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B78u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRM.
*/
#define	SRC_DSADCSRM5	(SRC_DSADC_DSADC5_SRM)

/** \brief  20, Emulation Memory Service Request */
#define SRC_EMEM_EMEM0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038020u)

/** Alias (User Manual Name) for SRC_EMEM_EMEM0_SR.
* To use register names with standard convension, please use SRC_EMEM_EMEM0_SR.
*/
#define	SRC_EMEM	(SRC_EMEM_EMEM0_SR)

/** \brief  C04, E-RAY Input Buffer Busy Service Request */
#define SRC_ERAY_ERAY0_IBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C04u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_IBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_IBUSY.
*/
#define	SRC_ERAYIBUSY	(SRC_ERAY_ERAY0_IBUSY)

/** \brief  BE0, E-RAY Service Request */
#define SRC_ERAY_ERAY0_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE0u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_INT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_INT0.
*/
#define	SRC_ERAYINT0	(SRC_ERAY_ERAY0_INT0)

/** \brief  BE4, E-RAY Service Request */
#define SRC_ERAY_ERAY0_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE4u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_INT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_INT1.
*/
#define	SRC_ERAYINT1	(SRC_ERAY_ERAY0_INT1)

/** \brief  BF8, E-RAY Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY0_MBSC0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF8u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_MBSC0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_MBSC0.
*/
#define	SRC_ERAYMBSC0	(SRC_ERAY_ERAY0_MBSC0)

/** \brief  BFC, E-RAY Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY0_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BFCu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_MBSC1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_MBSC1.
*/
#define	SRC_ERAYMBSC1	(SRC_ERAY_ERAY0_MBSC1)

/** \brief  BF0, E-RAY New Data Service Request */
#define SRC_ERAY_ERAY0_NDAT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF0u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_NDAT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_NDAT0.
*/
#define	SRC_ERAYNDAT0	(SRC_ERAY_ERAY0_NDAT0)

/** \brief  BF4, E-RAY New Data Service Request */
#define SRC_ERAY_ERAY0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF4u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_NDAT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_NDAT1.
*/
#define	SRC_ERAYNDAT1	(SRC_ERAY_ERAY0_NDAT1)

