feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GPT12_GPT120_T4.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T4.
*/
#define	SRC_GPT120T4	(SRC_GPT12_GPT120_T4)

/** \brief  470, GPT12 T5 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038470u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T5.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T5.
*/
#define	SRC_GPT120T5	(SRC_GPT12_GPT120_T5)

/** \brief  474, GPT12 T6 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038474u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T6.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T6.
*/
#define	SRC_GPT120T6	(SRC_GPT12_GPT120_T6)

/** \brief  1600, GTM AEI Shared Service Request */
#define SRC_GTM_GTM0_AEIIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039600u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_AEIIRQ.
* To use register names with standard convension, please use SRC_GTM_GTM0_AEIIRQ.
*/
#define	SRC_GTMAEIIRQ	(SRC_GTM_GTM0_AEIIRQ)

/** \brief  1604, GTM ARU Shared Service Request */
#define SRC_GTM_GTM0_ARUIRQ0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039604u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ARUIRQ0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ARUIRQ0.
*/
#define	SRC_GTMARUIRQ0	(SRC_GTM_GTM0_ARUIRQ0)

/** \brief  1608, GTM ARU Shared Service Request */
#define SRC_GTM_GTM0_ARUIRQ1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039608u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ARUIRQ1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ARUIRQ1.
*/
#define	SRC_GTMARUIRQ1	(SRC_GTM_GTM0_ARUIRQ1)

/** \brief  160C, GTM ARU Shared Service Request */
#define SRC_GTM_GTM0_ARUIRQ2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003960Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ARUIRQ2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ARUIRQ2.
*/
#define	SRC_GTMARUIRQ2	(SRC_GTM_GTM0_ARUIRQ2)

/** \brief  1D80, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM0_0.
*/
#define	SRC_GTMATOM00	(SRC_GTM_GTM0_ATOM0_0)

/** \brief  1D84, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D84u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM0_1.
*/
#define	SRC_GTMATOM01	(SRC_GTM_GTM0_ATOM0_1)

/** \brief  1D88, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D88u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM0_2.
*/
#define	SRC_GTMATOM02	(SRC_GTM_GTM0_ATOM0_2)

/** \brief  1D8C, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D8Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM0_3.
*/
#define	SRC_GTMATOM03	(SRC_GTM_GTM0_ATOM0_3)

/** \brief  1D90, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D90u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_0.
*/
#define	SRC_GTMATOM10	(SRC_GTM_GTM0_ATOM1_0)

/** \brief  1D94, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_1.
*/
#define	SRC_GTMATOM11	(SRC_GTM_GTM0_ATOM1_1)

/** \brief  1D98, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_2.
*/
#define	SRC_GTMATOM12	(SRC_GTM_GTM0_ATOM1_2)

/** \brief  1D9C, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_3.
*/
#define	SRC_GTMATOM13	(SRC_GTM_GTM0_ATOM1_3)

/** \brief  1DA0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_0.
*/
#define	SRC_GTMATOM20	(SRC_GTM_GTM0_ATOM2_0)

/** \brief  1DA4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_1.
*/
#define	SRC_GTMATOM21	(SRC_GTM_GTM0_ATOM2_1)

/** \brief  1DA8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_2.
*/
#define	SRC_GTMATOM22	(SRC_GTM_GTM0_ATOM2_2)

/** \brief  1DAC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_3.
*/
#define	SRC_GTMATOM23	(SRC_GTM_GTM0_ATOM2_3)

/** \brief  1DB0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DB0u)

