feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_0.
*/
#define	SRC_GTMATOM30	(SRC_GTM_GTM0_ATOM3_0)

/** \brief  1DB4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DB4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_1.
*/
#define	SRC_GTMATOM31	(SRC_GTM_GTM0_ATOM3_1)

/** \brief  1DB8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DB8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_2.
*/
#define	SRC_GTMATOM32	(SRC_GTM_GTM0_ATOM3_2)

/** \brief  1DBC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DBCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_3.
*/
#define	SRC_GTMATOM33	(SRC_GTM_GTM0_ATOM3_3)

/** \brief  1DC0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DC0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_0.
*/
#define	SRC_GTMATOM40	(SRC_GTM_GTM0_ATOM4_0)

/** \brief  1DC4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DC4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_1.
*/
#define	SRC_GTMATOM41	(SRC_GTM_GTM0_ATOM4_1)

/** \brief  1DC8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DC8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_2.
*/
#define	SRC_GTMATOM42	(SRC_GTM_GTM0_ATOM4_2)

/** \brief  1DCC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DCCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_3.
*/
#define	SRC_GTMATOM43	(SRC_GTM_GTM0_ATOM4_3)

/** \brief  1614, GTM BRC Shared Service Request */
#define SRC_GTM_GTM0_BRCIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039614u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_BRCIRQ.
* To use register names with standard convension, please use SRC_GTM_GTM0_BRCIRQ.
*/
#define	SRC_GTMBRCIRQ	(SRC_GTM_GTM0_BRCIRQ)

/** \brief  1618, GTM CMP Shared Service Request */
#define SRC_GTM_GTM0_CMPIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039618u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_CMPIRQ.
* To use register names with standard convension, please use SRC_GTM_GTM0_CMPIRQ.
*/
#define	SRC_GTMCMPIRQ	(SRC_GTM_GTM0_CMPIRQ)

/** \brief  16A4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396A4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL0.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL0.
*/
#define	SRC_GTMDPLL0	(SRC_GTM_GTM0_DPLL0)

/** \brief  16A8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396A8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL1.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL1.
*/
#define	SRC_GTMDPLL1	(SRC_GTM_GTM0_DPLL1)

/** \brief  16CC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396CCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL10.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL10.
*/
#define	SRC_GTMDPLL10	(SRC_GTM_GTM0_DPLL10)

/** \brief  16D0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396D0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL11.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL11.
*/
#define	SRC_GTMDPLL11	(SRC_GTM_GTM0_DPLL11)

/** \brief  16D4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396D4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL12.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL12.
*/
#define	SRC_GTMDPLL12	(SRC_GTM_GTM0_DPLL12)

/** \brief  16D8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396D8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL13.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL13.
*/
#define	SRC_GTMDPLL13	(SRC_GTM_GTM0_DPLL13)

/** \brief  16DC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396DCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL14.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL14.
*/
#define	SRC_GTMDPLL14	(SRC_GTM_GTM0_DPLL14)

/** \brief  16E0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396E0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL15.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL15.
*/
#define	SRC_GTMDPLL15	(SRC_GTM_GTM0_DPLL15)

/** \brief  16E4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL16 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396E4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL16.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL16.
*/
#define	SRC_GTMDPLL16	(SRC_GTM_GTM0_DPLL16)

/** \brief  16E8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL17 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396E8u)

