feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS0_4.
*/
#define	SRC_GTMMCS04	(SRC_GTM_GTM0_MCS0_4)

/** \brief  1994, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039994u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS0_5.
*/
#define	SRC_GTMMCS05	(SRC_GTM_GTM0_MCS0_5)

/** \brief  1998, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039998u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS0_6.
*/
#define	SRC_GTMMCS06	(SRC_GTM_GTM0_MCS0_6)

/** \brief  199C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003999Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS0_7.
*/
#define	SRC_GTMMCS07	(SRC_GTM_GTM0_MCS0_7)

/** \brief  19A0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399A0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_0.
*/
#define	SRC_GTMMCS10	(SRC_GTM_GTM0_MCS1_0)

/** \brief  19A4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399A4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_1.
*/
#define	SRC_GTMMCS11	(SRC_GTM_GTM0_MCS1_1)

/** \brief  19A8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399A8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_2.
*/
#define	SRC_GTMMCS12	(SRC_GTM_GTM0_MCS1_2)

/** \brief  19AC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399ACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_3.
*/
#define	SRC_GTMMCS13	(SRC_GTM_GTM0_MCS1_3)

/** \brief  19B0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399B0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_4.
*/
#define	SRC_GTMMCS14	(SRC_GTM_GTM0_MCS1_4)

/** \brief  19B4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399B4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_5.
*/
#define	SRC_GTMMCS15	(SRC_GTM_GTM0_MCS1_5)

/** \brief  19B8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399B8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_6.
*/
#define	SRC_GTMMCS16	(SRC_GTM_GTM0_MCS1_6)

/** \brief  19BC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS1_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399BCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS1_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS1_7.
*/
#define	SRC_GTMMCS17	(SRC_GTM_GTM0_MCS1_7)

/** \brief  19C0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399C0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_0.
*/
#define	SRC_GTMMCS20	(SRC_GTM_GTM0_MCS2_0)

/** \brief  19C4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399C4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_1.
*/
#define	SRC_GTMMCS21	(SRC_GTM_GTM0_MCS2_1)

/** \brief  19C8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399C8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_2.
*/
#define	SRC_GTMMCS22	(SRC_GTM_GTM0_MCS2_2)

/** \brief  19CC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399CCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_3.
*/
#define	SRC_GTMMCS23	(SRC_GTM_GTM0_MCS2_3)

/** \brief  19D0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399D0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_4.
*/
#define	SRC_GTMMCS24	(SRC_GTM_GTM0_MCS2_4)

/** \brief  19D4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399D4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_5.
*/
#define	SRC_GTMMCS25	(SRC_GTM_GTM0_MCS2_5)

/** \brief  19D8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399D8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_6.
*/
#define	SRC_GTMMCS26	(SRC_GTM_GTM0_MCS2_6)

/** \brief  19DC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399DCu)

